Core/src/Catalogs/НастройкиЯндексДоставки/НастройкиЯндексДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиЯндексДоставки</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючиМетодов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификаторы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Магазины</name>
    <comment>senders</comment>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <comment>warehouses</comment>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Состояния</name>
    <attributes>
      <name>ВидЗаказаПокупателя</name>
      <type>
        <types>CatalogRef.ВидыЗаказовПокупателей</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗаказаПокупателя</name>
      <type>
        <types>CatalogRef.СостоянияЗаказовПокупателей</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЯндексДоставки</name>
      <type>
        <types>EnumRef.СтатусыЯндексДоставки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Enums/СтатусыЯндексДоставки/СтатусыЯндексДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЯндексДоставки</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>ЖдетПодтвержденияСлужбыДоставки</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденСлужбойДоставки</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЕдинымСкладом</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяНаЕдиномСкладе</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяВСлужбеДоставки</name>
  </enumValues>
  <enumValues>
    <name>НаЕдиномСкладе</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПередачеВСлужбуДоставки</name>
  </enumValues>
  <enumValues>
    <name>ПереданВСлужбуДоставки</name>
  </enumValues>
  <enumValues>
    <name>НаСкладеСлужбыДоставки</name>
  </enumValues>
  <enumValues>
    <name>Доставляется</name>
  </enumValues>
  <enumValues>
    <name>ВГородеПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ДоставляетсяПоГороду</name>
  </enumValues>
  <enumValues>
    <name>ВПунктеСамовывоза</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>ГотовитсяКВозврату</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенНаСкладСлужбыДоставки</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенНаЕдиныйСклад</name>
  </enumValues>
  <enumValues>
    <name>ГотовКВозвратуВМагазин</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенВМагазин</name>
  </enumValues>
  <enumValues>
    <name>Утерян</name>
  </enumValues>
  <enumValues>
    <name>СтатусУточняется</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктурныеЕдиницы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОсновноеПодразделение</name>
      <description>Основное подразделение</description>
    </items>
    <items>
      <name>ОсновнойСклад</name>
      <description>Основной склад</description>
    </items>
    <items>
      <name>ТранзитныйСклад</name>
      <description>ტრანზიტული საწყობი</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСтруктурнойЕдиницы</name>
    <type>
      <types>EnumRef.ТипыСтруктурныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрдерныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМОЛ</name>
    <comment>Подпись материально-ответственного лица</comment>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРознице</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценки</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОтходов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяОтходов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРозницеРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценкиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранзитныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/ВидыЗаказовПокупателей/ВидыЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗаказовПокупателей</name>
  <predefined>
    <items>
      <name>Основной</name>
      <description>Основной</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДоставлен</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОтгружен</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОжидаетОтгрузки</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьДоставку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокСостояний</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.СостоянияЗаказовПокупателей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/НастройкиЯндексДоставки/Forms/ФормаЭлемента/Module.bsl
#Область ПеременныеФормы

&НаКлиенте
Перем КэшВыборСостояний, КэшДобавленныеСостояния;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ПриСозданииПриЧтенииНаСервере(ТекущийОбъектИзРеквизитаФормы());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииПриЧтенииНаСервере(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ВидыЗаказовПокупателей"
		Или ИмяСобытия = "Запись_СостоянияЗаказовПокупателей" Тогда
		КэшВыборСостояний = Новый Соответствие;
		ДополнитьКэшДобавленныеСостояния(Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Перем Ошибки;
	
	ПроверитьСоответствиеМагазинов(Ошибки);
	ПроверитьСоответствиеСкладов(Ошибки);
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТЧСостояния();
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Расписание = Новый ХранилищеЗначения(Расписание);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьВидыЗаказаПокупателя(ТекущийОбъект.Состояния);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	КэшВыборСостояний = Новый Соответствие;
	Оповестить("Запись_НастройкиЯндексДоставки");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИдентификаторыПриИзменении(Элемент)
	
	Идентификаторы = ПрочитатьИдентификаторыИзJSON(Объект.Идентификаторы);
	ЗаполнитьТЧМагазины(Идентификаторы);
	ЗаполнитьТЧСклады(Идентификаторы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьРасписание(Команда)
	
	ДиалогНастройкиРасписания = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	ДиалогНастройкиРасписания.Показать(Новый ОписаниеОповещения("ОбработатьИзменениеРасписания", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаказыИзЯндексДоставки(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	Элементы.ГруппаВыполнениеЗадания.ТекущаяСтраница = Элементы.ГруппаИндикатор;
	ПодключитьОбработчикОжидания("ЗапуститьОбновлениеЗаказовИзЯндексДоставки", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыМагазины

&НаКлиенте
Процедура МагазиныСтруктурнаяЕдиницаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОчиститьДублирующиесяЗначения(ВыбранноеЗначение, "Магазины");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСклады

&НаКлиенте
Процедура СкладыСтруктурнаяЕдиницаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОчиститьДублирующиесяЗначения(ВыбранноеЗначение, "Склады");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСостояния

&НаКлиенте
Процедура Подключаемый_ВидЗаказаПриИзменении(Элемент)
	
	Элементы.АвтообновлениеПояснение.Видимость = ВидимостьАвтообновлениеПояснение(
	ЭтотОбъект.СтатусыСостояния,
	ЭтотОбъект.ВидыЗаказаПокупателя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВидЗаказаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(КэшВыборСостояний) Тогда
		КэшВыборСостояний = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого ТекСтрокаВидЗаказа Из ВидыЗаказаПокупателя Цикл
		
		Если Элемент.Имя <> ТекСтрокаВидЗаказа.ИмяКолонки Тогда
			Продолжить;
		КонецЕсли;
		
		Если КэшВыборСостояний[ТекСтрокаВидЗаказа.ВидЗаказа] <> Неопределено Тогда
			Результат = КэшВыборСостояний[ТекСтрокаВидЗаказа.ВидЗаказа];
			Прервать;
		КонецЕсли;
		
		КэшВыборСостояний[ТекСтрокаВидЗаказа.ВидЗаказа] = СписокВыбораСостоянияПоВидуЗаказаНаСервере(ТекСтрокаВидЗаказа.ВидЗаказа);
		Результат = КэшВыборСостояний[ТекСтрокаВидЗаказа.ВидЗаказа];
		Прервать;
		
	КонецЦикла;
	
	ДанныеВыбора = ДанныеВыбораИДобавленныеСостояния(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ТекущийОбъектИзРеквизитаФормы()
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Результат = Параметры.ЗначениеКопирования.ПолучитьОбъект();
	Иначе
		Результат = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПрочитатьИдентификаторыИзJSON(ИдентификаторыСтрока)
	
	ЧтениеJSON_IDs = Новый ЧтениеJSON;
	ЧтениеJSON_IDs.УстановитьСтроку(ИдентификаторыСтрока);
	
	Возврат ПрочитатьJSON(ЧтениеJSON_IDs, Истина);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТЧМагазины(Идентификаторы)
	
	Объект.Магазины.Очистить();
	
	Для Каждого ТекЗапись Из Идентификаторы["senders"] Цикл
		СтрокаМагазин = Объект.Магазины.Добавить();
		СтрокаМагазин.Идентификатор = ТекЗапись["id"];
		СтрокаМагазин.Наименование = ТекЗапись["name"];
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧСклады(Идентификаторы)
	
	Объект.Склады.Очистить();
	
	Для Каждого ТекЗапись Из Идентификаторы["warehouses"] Цикл
		СтрокаСклад = Объект.Склады.Добавить();
		СтрокаСклад.Идентификатор = ТекЗапись["id"];
		СтрокаСклад.Наименование = ТекЗапись["name"];
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧСостояния()
	
	Объект.Состояния.Очистить();
	Для Каждого ТекСтрокаСтатусыСостояния Из ЭтотОбъект.СтатусыСостояния Цикл
		Для Каждого ТекСтрокаВидЗаказа Из ВидыЗаказаПокупателя Цикл
			ТекСостояниеЗаказаПокупателя = ТекСтрокаСтатусыСостояния[ТекСтрокаВидЗаказа.ИмяКолонки];
			Если ЗначениеЗаполнено(ТекСостояниеЗаказаПокупателя) Тогда
				НоваяСтрокаСостояния = Объект.Состояния.Добавить();
				НоваяСтрокаСостояния.ВидЗаказаПокупателя = ТекСтрокаВидЗаказа.ВидЗаказа;
				НоваяСтрокаСостояния.СтатусЯндексДоставки = ТекСтрокаСтатусыСостояния.СтатусЯндексДоставки;
				НоваяСтрокаСостояния.СостояниеЗаказаПокупателя = ТекСостояниеЗаказаПокупателя;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДублирующиесяЗначения(Знач ВыбранноеЗначение, Знач ИмяТаблицы)
	
	Для Каждого ТекСтрокаТаблицы Из Объект[ИмяТаблицы] Цикл
		Если ТекСтрокаТаблицы.ПолучитьИдентификатор() = Элементы[ИмяТаблицы].ТекущаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		Если ТекСтрокаТаблицы.СтруктурнаяЕдиница = ВыбранноеЗначение Тогда
			ТекСтрокаТаблицы.СтруктурнаяЕдиница = ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере(ТекущийОбъект)
	
	УдаляемыеРеквизиты = УдаляемыеРеквизиты();
	
	ЗаполнитьВидыЗаказаПокупателя();
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты(), УдаляемыеРеквизиты);
	
	ЗаполнитьСтатусыСостояния();
	
	ПересоздатьЭлементыСтатусыСостояния();
	
	ПрочитанноеРасписание = ТекущийОбъект.Расписание.Получить();
	Если ТипЗнч(ПрочитанноеРасписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
		Расписание = ПрочитанноеРасписание;
	Иначе
		Расписание = ЯндексДоставка.РасписаниеПоУмолчанию();
	КонецЕсли;
	
	ОбновитьЗаголовокРасписания();
	
	Элементы.АвтообновлениеПояснение.Видимость = ВидимостьАвтообновлениеПояснение(
	ЭтотОбъект.СтатусыСостояния,
	ЭтотОбъект.ВидыЗаказаПокупателя);
	
КонецПроцедуры

&НаСервере
Функция УдаляемыеРеквизиты()
	
	Результат = Новый Массив;
	
	Для Каждого ТекРеквизит Из ПолучитьРеквизиты() Цикл
		Если ТекРеквизит.Имя = "СтатусыСостояния" Тогда
			Результат.Добавить("СтатусыСостояния");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВидыЗаказаПокупателя()
	
	ВидыЗаказаПокупателя.Очистить();
	
	СтрокаОсновной = ВидыЗаказаПокупателя.Добавить();
	СтрокаОсновной.ВидЗаказа = Справочники.ВидыЗаказовПокупателей.Основной;
	СтрокаОсновной.Представление = Справочники.ВидыЗаказовПокупателей.Основной.Наименование;
	СтрокаОсновной.ИмяКолонки = ИмяКолонкиВидЗаказа(СтрокаОсновной.ВидЗаказа);
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыЗаказовПокупателей.Ссылка,
	|	ВидыЗаказовПокупателей.Наименование
	|ИЗ
	|	Справочник.ВидыЗаказовПокупателей КАК ВидыЗаказовПокупателей
	|ГДЕ
	|	НЕ ВидыЗаказовПокупателей.ПометкаУдаления
	|	И НЕ ВидыЗаказовПокупателей.Предопределенный
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыЗаказовПокупателей.Наименование");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаВидЗаказа = ВидыЗаказаПокупателя.Добавить();
		СтрокаВидЗаказа.ВидЗаказа = Выборка.Ссылка;
		СтрокаВидЗаказа.Представление = Выборка.Наименование;
		СтрокаВидЗаказа.ИмяКолонки = ИмяКолонкиВидЗаказа(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДобавляемыеРеквизиты()
	
	Результат = Новый Массив;
	
	Результат.Добавить(
	Новый РеквизитФормы(
	"СтатусыСостояния",
	Новый ОписаниеТипов("ТаблицаЗначений"),,,
	Истина));
	
	Результат.Добавить(
	Новый РеквизитФормы(
	"СтатусЯндексДоставки",
	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЯндексДоставки"),
	"СтатусыСостояния",
	НСтр("ka='Статус в Яндекс.Доставке';ru='Статус в Яндекс.Доставке';en='Status Yandeks.Dostavke'"),
	Истина));
	
	Для Каждого ТекСтрокаВидЗаказа Из ВидыЗаказаПокупателя Цикл
		Результат.Добавить(Новый РеквизитФормы(
		ТекСтрокаВидЗаказа.ИмяКолонки,
		Новый ОписаниеТипов("СправочникСсылка.СостоянияЗаказовПокупателей"),
		"СтатусыСостояния",
		ТекСтрокаВидЗаказа.Представление,
		Истина));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИмяКолонкиВидЗаказа(ВидЗаказа)
	
	Возврат СтрШаблон("ВидЗаказа%1",
	СтрЗаменить(ВидЗаказа.УникальныйИдентификатор(), "-", ""));
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтатусыСостояния()
	
	ЭтотОбъект.СтатусыСостояния.Очистить();
	Для Каждого ТекСтатус Из Перечисления.СтатусыЯндексДоставки Цикл
		НоваяСтрока = ЭтотОбъект.СтатусыСостояния.Добавить();
		НоваяСтрока.СтатусЯндексДоставки = ТекСтатус;
		Для Каждого ТекСтрокаВидЗаказа Из ВидыЗаказаПокупателя Цикл
			ОтборВидЗаказаСтатус = Новый Структура;
			ОтборВидЗаказаСтатус.Вставить("СтатусЯндексДоставки", ТекСтатус);
			ОтборВидЗаказаСтатус.Вставить("ВидЗаказаПокупателя", ТекСтрокаВидЗаказа.ВидЗаказа);
			СостоянияПоВидуЗаказа = Объект.Состояния.НайтиСтроки(ОтборВидЗаказаСтатус);
			Для Каждого ТекСтрокаПривязанныеСостояния Из СостоянияПоВидуЗаказа Цикл
				НоваяСтрока[ТекСтрокаВидЗаказа.ИмяКолонки] = ТекСтрокаПривязанныеСостояния.СостояниеЗаказаПокупателя;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПересоздатьЭлементыСтатусыСостояния()
	
	НайденныйЭлемент = Элементы.Найти("СтатусыСостояния");
	Если НайденныйЭлемент <> Неопределено Тогда
		Элементы.Удалить(НайденныйЭлемент);
	КонецЕсли;
	
	ЭлементСтатусыСостояния = Элементы.Добавить("СтатусыСостояния", Тип("ТаблицаФормы"), Элементы.ГруппаСостоянияЗаказов);
	ЭлементСтатусыСостояния.ПутьКДанным = "СтатусыСостояния";
	ЭлементСтатусыСостояния.ИзменятьСоставСтрок = Ложь;
	ЭлементСтатусыСостояния.ИзменятьПорядокСтрок = Ложь;
	ЭлементСтатусыСостояния.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	ЭлементСтатусЯндексДоставки = Элементы.Добавить("СтатусЯндексДоставки", Тип("ПолеФормы"), ЭлементСтатусыСостояния);
	ЭлементСтатусЯндексДоставки.ПутьКДанным = "СтатусыСостояния.СтатусЯндексДоставки";
	ЭлементСтатусЯндексДоставки.Ширина = 35;
	
	Для Каждого ТекСтрокаВидЗаказа Из ВидыЗаказаПокупателя Цикл
		
		ЭлементВидЗаказа = Элементы.Добавить(
		ТекСтрокаВидЗаказа.ИмяКолонки,
		Тип("ПолеФормы"),
		ЭлементСтатусыСостояния);
		ЭлементВидЗаказа.ПутьКДанным = СтрШаблон("СтатусыСостояния.%1", ТекСтрокаВидЗаказа.ИмяКолонки);
		ЭлементВидЗаказа.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементВидЗаказа.КнопкаОткрытия = Ложь;
		Если ВидыЗаказаПокупателя.Количество() > 1 Тогда
			ЭлементВидЗаказа.КнопкаСоздания = Ложь;
		КонецЕсли;
		ЭлементВидЗаказа.УстановитьДействие("ПриИзменении", "Подключаемый_ВидЗаказаПриИзменении");
		ЭлементВидЗаказа.УстановитьДействие("АвтоПодбор", "Подключаемый_ВидЗаказаАвтоПодбор");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеРасписания(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("РасписаниеРегламентногоЗадания") Тогда
		ОбработатьИзменениеРасписанияНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеРасписанияНаСервере(Знач НовоеРасписание) Экспорт
	
	Расписание = НовоеРасписание;
	
	Расписание.ДетальныеРасписанияДня = Новый Массив;
	
	Если ЗначениеЗаполнено(Расписание.ПериодПовтораВТечениеДня)
		И Расписание.ПериодПовтораВТечениеДня < 60 * 60 Тогда
		Расписание.ПериодПовтораВТечениеДня = 60 * 60;
	КонецЕсли;
	
	ОбновитьЗаголовокРасписания();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокРасписания()
	
	Элементы.НастроитьРасписание.Заголовок = Строка(Расписание);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВидимостьАвтообновлениеПояснение(Знач СтатусыСостояния, Знач ВидыЗаказаПокупателя)
	
	Для Каждого ТекСтрокаСтатусыСостояния Из СтатусыСостояния Цикл
		Для Каждого ТекСтрокаВидЗаказа Из ВидыЗаказаПокупателя Цикл
			Если ЗначениеЗаполнено(ТекСтрокаСтатусыСостояния[ТекСтрокаВидЗаказа.ИмяКолонки]) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокВыбораСостоянияПоВидуЗаказаНаСервере(Знач ВидЗаказа)
	
	Возврат Справочники.СостоянияЗаказовПокупателей.ПолучитьДанныеВыбора(
	Новый Структура("ВидЗаказа", ВидЗаказа));
	
КонецФункции

&НаКлиенте
Процедура ДополнитьКэшДобавленныеСостояния(СостояниеЗаказаПокупателя)
	
	Если ТипЗнч(СостояниеЗаказаПокупателя) <> Тип("СправочникСсылка.СостоянияЗаказовПокупателей") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КэшДобавленныеСостояния) Тогда
		КэшДобавленныеСостояния = Новый Соответствие;
	КонецЕсли;
	
	КэшДобавленныеСостояния[СостояниеЗаказаПокупателя] = Строка(СостояниеЗаказаПокупателя);
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеВыбораИДобавленныеСостояния(Параметр)
	
	Результат = Новый СписокЗначений;
	
	Для Каждого ТекЗначение Из Параметр Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), ТекЗначение);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(КэшДобавленныеСостояния) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ТекДобавленноеСостояние Из КэшДобавленныеСостояния Цикл
		Если Результат.НайтиПоЗначению(ТекДобавленноеСостояние.Ключ) = Неопределено Тогда
			Результат.Добавить(ТекДобавленноеСостояние.Ключ, ТекДобавленноеСостояние.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьВидыЗаказаПокупателя(Знач ТаблицаСостояния)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаСостояния.ВидЗаказаПокупателя КАК ВидЗаказаПокупателя,
	|	ТаблицаСостояния.СостояниеЗаказаПокупателя КАК СостояниеЗаказаПокупателя
	|ПОМЕСТИТЬ ВТ_Состояния
	|ИЗ
	|	&ТаблицаСостояния КАК ТаблицаСостояния
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Состояния.ВидЗаказаПокупателя,
	|	ВТ_Состояния.СостояниеЗаказаПокупателя,
	|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка,
	|	ВидыЗаказовПокупателейПорядокСостояний.Состояние
	|ИЗ
	|	ВТ_Состояния КАК ВТ_Состояния
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
	|		ПО ВТ_Состояния.ВидЗаказаПокупателя = ВидыЗаказовПокупателейПорядокСостояний.Ссылка
	|			И ВТ_Состояния.СостояниеЗаказаПокупателя = ВидыЗаказовПокупателейПорядокСостояний.Состояние");
	Запрос.УстановитьПараметр("ТаблицаСостояния", ТаблицаСостояния);
	
	ВидыЗаказаПокупателяДляЗаписи = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ВидыЗаказаПокупателяДляЗаписи[Выборка.ВидЗаказаПокупателя] = Неопределено Тогда
			ВидыЗаказаПокупателяДляЗаписи[Выборка.ВидЗаказаПокупателя] = Новый Массив;
		КонецЕсли;
		
		ВидыЗаказаПокупателяДляЗаписи[Выборка.ВидЗаказаПокупателя].Добавить(Выборка.СостояниеЗаказаПокупателя);
		
	КонецЦикла;
	
	Для Каждого ТекВидЗаказаПокупателя Из ВидыЗаказаПокупателяДляЗаписи Цикл
		ВидЗаказаОбъект = ТекВидЗаказаПокупателя.Ключ.ПолучитьОбъект();
		Для Каждого ТекСостояние Из ТекВидЗаказаПокупателя.Значение Цикл
			Если ВидЗаказаОбъект.ПорядокСостояний.Найти(ТекСостояние) = Неопределено Тогда
				НоваяСтрока = ВидЗаказаОбъект.ПорядокСостояний.Добавить();
				НоваяСтрока.Состояние = ТекСостояние;
			КонецЕсли;
		КонецЦикла;
		Если ВидЗаказаОбъект.Модифицированность() Тогда
			ВидЗаказаОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоответствиеМагазинов(Ошибки)
	
	Для Каждого ТекСтрокаМагазины Из Объект.Магазины Цикл
		Если ЗначениеЗаполнено(ТекСтрокаМагазины.СтруктурнаяЕдиница) Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
	Ошибки,
	"Объект.Магазины",
	НСтр("ka='Установите соответствие магазинов и подразделений.';ru='Установите соответствие магазинов и подразделений.';en='Set your shops and offices.'"),
	"Объект.Магазины");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоответствиеСкладов(Ошибки)
	
	Для Каждого ТекСтрокаСклады Из Объект.Склады Цикл
		Если ЗначениеЗаполнено(ТекСтрокаСклады.СтруктурнаяЕдиница) Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
	Ошибки,
	"Объект.Склады",
	НСтр("ka='Установите соответствие складов.';ru='Установите соответствие складов.';en='Set your warehouses.'"),
	"Объект.Склады");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбновлениеЗаказовИзЯндексДоставки()
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	Задание = ЗаданиеОбновлениеЗаказовИзЯндексДоставки(УникальныйИдентификатор, Объект.Ссылка);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
	Задание,
	Новый ОписаниеОповещения("ОбработатьЗавершениеЗадания", ЭтотОбъект),
	ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеОбновлениеЗаказовИзЯндексДоставки(ИдентификаторФормы, СсылкаНаОбъект)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
	"ЯндексДоставка.ЗаданиеЗагрузкаДанныхИзЯндексДоставки",
	Строка(СсылкаНаОбъект.УникальныйИдентификатор()),
	ПараметрыВыполнения);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьЗавершениеЗадания(Результат, Параметры) Экспорт
	
	Элементы.ГруппаВыполнениеЗадания.ТекущаяСтраница = Элементы.ГруппаЗапуск;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОтобразитьОбновленныеЗаказы(Результат.АдресРезультата);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОбновленныеЗаказы(АдресРезультата)
	
	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновленныеЗаказы = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(ОбновленныеЗаказы) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОповещения = СтрШаблон("%1 %2",
	СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
	ОбновленныеЗаказы.Количество(),
	НСтр("ka='Обновлен,Обновлено,Обновлено';ru='Обновлен,Обновлено,Обновлено';en='Updated, Updated, Updated'"),
	Ложь),
	СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
	ОбновленныеЗаказы.Количество(),
	НСтр("ka='заказ,заказа,заказов';ru='заказ,заказа,заказов';en='Order, order, order'")));
	
	ПоказатьОповещениеПользователя(ТекстОповещения);
	
КонецПроцедуры

#КонецОбласти
